In [1]:
import pandas as pd

<h2>Append Rows</h2>

In [2]:
weather = pd.DataFrame({
    'city': ['khanyounis', 'rafah', 'gaza'],
    'temperature': [32, 42, 20],
    'humidity': [80, 60, 40]
})

weather

         city  temperature  humidity
0  khanyounis           32        80
1       rafah           42        60
2        gaza           20        40

In [3]:
us_weather = pd.DataFrame({
    'city': ['New York', 'chicago', 'Texas'],
    'temperature': [21, 42, 35],
    'humidity': [30, 20, 40]
})

us_weather

       city  temperature  humidity
0  New York           21        30
1   chicago           42        20
2     Texas           35        40

In [4]:
df = pd.concat([weather, us_weather])
df

         city  temperature  humidity
0  khanyounis           32        80
1       rafah           42        60
2        gaza           20        40
0    New York           21        30
1     chicago           42        20
2       Texas           35        40

In [5]:
#to make index contuious
df = pd.concat([weather, us_weather], ignore_index = True)
df

         city  temperature  humidity
0  khanyounis           32        80
1       rafah           42        60
2        gaza           20        40
3    New York           21        30
4     chicago           42        20
5       Texas           35        40

In [8]:
df = pd.concat([weather, us_weather], keys= ['palestine', 'us'])
df

                   city  temperature  humidity
palestine 0  khanyounis           32        80
          1       rafah           42        60
          2        gaza           20        40
us        0    New York           21        30
          1     chicago           42        20
          2       Texas           35        40

In [11]:
df.loc['us']

       city  temperature  humidity
0  New York           21        30
1   chicago           42        20
2     Texas           35        40

In [15]:
df.loc['us', 1]

city           chicago
temperature         42
humidity            20
Name: (us, 1), dtype: object

<h2>Append Columns</h2>

In [26]:
temperature_df = pd.DataFrame({
    'city': ['khanyounis', 'rafah', 'gaza'],
    'temperature': [32, 42, 20]
}, index=[0,1,2])
temperature_df

         city  temperature
0  khanyounis           32
1       rafah           42
2        gaza           20

In [27]:
windspeed_df = pd.DataFrame({
    'city': ['rafah', 'khanyounis'],
    'windspeed': [7, 4]
}, index= [1, 0])
windspeed_df

         city  windspeed
1       rafah          7
0  khanyounis          4

In [28]:
new_df = pd.concat([temperature_df, windspeed_df], axis= 1)
new_df

         city  temperature        city  windspeed
0  khanyounis           32  khanyounis        4.0
1       rafah           42       rafah        7.0
2        gaza           20         NaN        NaN

In [29]:
temperature_df

         city  temperature
0  khanyounis           32
1       rafah           42
2        gaza           20

In [31]:
s = pd.Series(['Rain', 'Sunny', 'Dry'], name= 'event')
s

0     Rain
1    Sunny
2      Dry
Name: event, dtype: object

In [32]:
new_df = pd.concat([temperature_df, s], axis= 1)
new_df

         city  temperature  event
0  khanyounis           32   Rain
1       rafah           42  Sunny
2        gaza           20    Dry